{
    "1,1": {
        "personality": "A double dose of leadership! These individuals are ambitious, confident, and highly independent. They may excel in innovation but must avoid arrogance or isolation.",
        "crystals": ["Garnet", "Clear Quartz"]
    },
    "1,2": {
        "personality": "Balances assertiveness with diplomacy. They are natural leaders who value harmony and collaboration, making them compassionate yet driven.",
        "crystals": ["Moonstone", "Carnelian"]
    },
    "1,3": {
        "personality": "A visionary with a creative flair! These individuals combine leadership skills with charisma, excelling in artistic and entrepreneurial ventures.",
        "crystals": ["Citrine", "Sunstone"]
    },
    "1,4": {
        "personality": "Practical visionaries who combine ambition with discipline. They excel in building strong foundations for their innovative ideas.",
        "crystals": ["Smoky Quartz", "Pyrite"]
    },
    "1,5": {
        "personality": "Adventurous leaders who thrive on change. They are bold, adaptable, and eager to explore new possibilities but must stay focused to achieve their goals.",
        "crystals": ["Turquoise", "Tiger's Eye"]
    },
    "1,6": {
        "personality": "A leader with a nurturing side. They are driven yet empathetic, often seeking to use their success to support and care for others.",
        "crystals": ["Rose Quartz", "Citrine"]
    },
    "1,7": {
        "personality": "An introspective leader. These individuals blend ambition with spirituality, often seeking deeper meaning in their pursuits.",
        "crystals": ["Labradorite", "Amethyst"]
    },
    "1,8": {
        "personality": "The powerhouse leader. Highly ambitious and authoritative, they are drawn to careers in business, finance, or management.",
        "crystals": ["Pyrite", "Garnet"]
    },
    "1,9": {
        "personality": "The altruistic leader. These individuals aim to use their leadership skills for the greater good, focusing on humanitarian efforts.",
        "crystals": ["Clear Quartz", "Rhodonite"]
    },
    "1,11": {
        "personality": "A visionary leader. They possess strong intuition and creativity, often inspiring others with their innovative ideas and spiritual insights.",
        "crystals": ["Selenite", "Amethyst"]
    },
    "2,1": {
        "personality": "A diplomatic leader. These individuals balance harmony and assertiveness, excelling in leadership roles that require tact and collaboration.",
        "crystals": ["Moonstone", "Garnet"]
    },
    "2,2": {
        "personality": "The ultimate peacemaker. These individuals are deeply empathetic, intuitive, and dedicated to creating harmony but must avoid being overly self-sacrificing.",
        "crystals": ["Selenite", "Rose Quartz"]
    },
    "2,3": {
        "personality": "A creative nurturer. Combining empathy with creativity, they shine in artistic and social environments, often inspiring others with their vision.",
        "crystals": ["Citrine", "Amazonite"]
    },
    "2,4": {
        "personality": "A steady diplomat. They are reliable and grounded, using their intuitive nature to build strong, harmonious foundations in both relationships and projects.",
        "crystals": ["Smoky Quartz", "Fluorite"]
    },
    "2,5": {
        "personality": "A free-spirited mediator. These individuals combine a love for harmony with adaptability, thriving in dynamic, fast-paced environments.",
        "crystals": ["Turquoise", "Moonstone"]
    },
    "2,6": {
        "personality": "A compassionate caregiver. They are natural nurturers who excel in creating harmony and supporting others, often in family or community-oriented roles.",
        "crystals": ["Rose Quartz", "Green Aventurine"]
    },
    "2,7": {
        "personality": "A spiritual peacemaker. These individuals combine intuition with introspection, often pursuing careers or hobbies that connect them to deeper spiritual truths.",
        "crystals": ["Amethyst", "Labradorite"]
    },
    "2,8": {
        "personality": "The balanced achiever. They harmoniously blend emotional intelligence with ambition, excelling in leadership roles that require fairness and empathy.",
        "crystals": ["Pyrite", "Amazonite"]
    },
    "2,9": {
        "personality": "The humanitarian peacemaker. These individuals dedicate their lives to creating harmony on a global scale, driven by compassion and a sense of purpose.",
        "crystals": ["Clear Quartz", "Rhodonite"]
    },
    "2,11": {
        "personality": "The intuitive visionary. Combining heightened sensitivity and spiritual insight, they are natural healers and guides, often working in creative or esoteric fields.",
        "crystals": ["Selenite", "Moonstone"]
    },
    "3,1": {
        "personality": "A creative leader. These individuals combine artistic flair with leadership skills, often inspiring others with their innovative ideas.",
        "crystals": ["Citrine", "Sunstone"]
    },
    "3,2": {
        "personality": "A diplomatic artist. They balance creativity with harmony, excelling in roles that require both artistic expression and collaboration.",
        "crystals": ["Moonstone", "Amazonite"]
    },
    "3,3": {
        "personality": "A triple dose of creativity! These individuals are highly expressive, charismatic, and excel in artistic and communicative fields.",
        "crystals": ["Citrine", "Sunstone"]
    },
    "3,4": {
        "personality": "A structured artist. They combine creativity with discipline, often excelling in fields that require both artistic expression and organization.",
        "crystals": ["Smoky Quartz", "Fluorite"]
    },
    "3,5": {
        "personality": "An adventurous creator. They thrive on change and creativity, often exploring new artistic and communicative possibilities.",
        "crystals": ["Turquoise", "Tiger's Eye"]
    },
    "3,6": {
        "personality": "A nurturing artist. They combine creativity with empathy, often using their artistic talents to support and inspire others.",
        "crystals": ["Rose Quartz", "Green Aventurine"]
    },
    "3,7": {
        "personality": "A spiritual artist. They blend creativity with introspection, often seeking deeper meaning in their artistic pursuits.",
        "crystals": ["Amethyst", "Labradorite"]
    },
    "3,8": {
        "personality": "A powerful creator. They combine creativity with ambition, often excelling in fields that require both artistic expression and leadership.",
        "crystals": ["Pyrite", "Garnet"]
    },
    "3,9": {
        "personality": "A humanitarian artist. They use their creativity for the greater good, often focusing on artistic projects that promote harmony and compassion.",
        "crystals": ["Clear Quartz", "Rhodonite"]
    },
    "3,11": {
        "personality": "A visionary artist. They possess strong intuition and creativity, often inspiring others with their innovative ideas and spiritual insights.",
        "crystals": ["Selenite", "Amethyst"]
    },
    "4,1": {
        "personality": "A structured leader. These individuals combine discipline with leadership skills, often excelling in roles that require organization and innovation.",
        "crystals": ["Smoky Quartz", "Pyrite"]
    },
    "4,2": {
        "personality": "A diplomatic organizer. They balance structure with harmony, excelling in roles that require both organization and collaboration.",
        "crystals": ["Moonstone", "Fluorite"]
    },
    "4,3": {
        "personality": "A creative organizer. They combine structure with creativity, often excelling in fields that require both organization and artistic expression.",
        "crystals": ["Citrine", "Smoky Quartz"]
    },
    "4,4": {
        "personality": "A double dose of structure! These individuals are highly organized, disciplined, and excel in roles that require precision and reliability.",
        "crystals": ["Smoky Quartz", "Fluorite"]
    },
    "4,5": {
        "personality": "An adventurous organizer. They thrive on change and structure, often exploring new organizational and communicative possibilities.",
        "crystals": ["Turquoise", "Tiger's Eye"]
    },
    "4,6": {
        "personality": "A nurturing organizer. They combine structure with empathy, often using their organizational skills to support and inspire others.",
        "crystals": ["Rose Quartz", "Green Aventurine"]
    },
    "4,7": {
        "personality": "A spiritual organizer. They blend structure with introspection, often seeking deeper meaning in their organizational pursuits.",
        "crystals": ["Amethyst", "Labradorite"]
    },
    "4,8": {
        "personality": "A powerful organizer. They combine structure with ambition, often excelling in fields that require both organization and leadership.",
        "crystals": ["Pyrite", "Garnet"]
    },
    "4,9": {
        "personality": "A humanitarian organizer. They use their organizational skills for the greater good, often focusing on projects that promote harmony and compassion.",
        "crystals": ["Clear Quartz", "Rhodonite"]
    },
    "4,11": {
        "personality": "A visionary organizer. They possess strong intuition and structure, often inspiring others with their innovative ideas and spiritual insights.",
        "crystals": ["Selenite", "Amethyst"]
    },
    "5,1": {
        "personality": "An adventurous leader. These individuals combine adaptability with leadership skills, often excelling in roles that require innovation and change.",
        "crystals": ["Turquoise", "Tiger's Eye"]
    },
    "5,2": {
        "personality": "A diplomatic adventurer. They balance adaptability with harmony, excelling in roles that require both change and collaboration.",
        "crystals": ["Moonstone", "Turquoise"]
    },
    "5,3": {
        "personality": "A creative adventurer. They combine adaptability with creativity, often excelling in fields that require both change and artistic expression.",
        "crystals": ["Citrine", "Turquoise"]
    },
    "5,4": {
        "personality": "A structured adventurer. They combine adaptability with discipline, often excelling in roles that require both change and organization.",
        "crystals": ["Smoky Quartz", "Turquoise"]
    },
    "5,5": {
        "personality": "A double dose of adventure! These individuals are highly adaptable, dynamic, and excel in roles that require flexibility and innovation.",
        "crystals": ["Turquoise", "Tiger's Eye"]
    },
    "5,6": {
        "personality": "A nurturing adventurer. They combine adaptability with empathy, often using their dynamic skills to support and inspire others.",
        "crystals": ["Rose Quartz", "Turquoise"]
    },
    "5,7": {
        "personality": "A spiritual adventurer. They blend adaptability with introspection, often seeking deeper meaning in their dynamic pursuits.",
        "crystals": ["Amethyst", "Turquoise"]
    },
    "5,8": {
        "personality": "A powerful adventurer. They combine adaptability with ambition, often excelling in fields that require both change and leadership.",
        "crystals": ["Pyrite", "Turquoise"]
    },
    "5,9": {
        "personality": "A humanitarian adventurer. They use their adaptability for the greater good, often focusing on projects that promote harmony and compassion.",
        "crystals": ["Clear Quartz", "Turquoise"]
    },
    "5,11": {
        "personality": "A visionary adventurer. They possess strong intuition and adaptability, often inspiring others with their innovative ideas and spiritual insights.",
        "crystals": ["Selenite", "Turquoise"]
    },
    "6,1": {
        "personality": "A nurturing leader. These individuals combine empathy with leadership skills, often excelling in roles that require compassion and innovation.",
        "crystals": ["Rose Quartz", "Garnet"]
    },
    "6,2": {
        "personality": "A diplomatic nurturer. They balance empathy with harmony, excelling in roles that require both compassion and collaboration.",
        "crystals": ["Moonstone", "Rose Quartz"]
    },
    "6,3": {
        "personality": "A creative nurturer. They combine empathy with creativity, often excelling in fields that require both compassion and artistic expression.",
        "crystals": ["Citrine", "Rose Quartz"]
    },
    "6,4": {
        "personality": "A structured nurturer. They combine empathy with discipline, often excelling in roles that require both compassion and organization.",
        "crystals": ["Smoky Quartz", "Rose Quartz"]
    },
    "6,5": {
        "personality": "An adventurous nurturer. They combine empathy with adaptability, often excelling in roles that require both compassion and change.",
        "crystals": ["Turquoise", "Rose Quartz"]
    },
    "6,6": {
        "personality": "A double dose of nurturing! These individuals are highly empathetic, caring, and excel in roles that require compassion and support.",
        "crystals": ["Rose Quartz", "Green Aventurine"]
    },
    "6,7": {
        "personality": "A spiritual nurturer. They blend empathy with introspection, often seeking deeper meaning in their compassionate pursuits.",
        "crystals": ["Amethyst", "Rose Quartz"]
    },
    "6,8": {
        "personality": "A powerful nurturer. They combine empathy with ambition, often excelling in fields that require both compassion and leadership.",
        "crystals": ["Pyrite", "Rose Quartz"]
    },
    "6,9": {
        "personality": "A humanitarian nurturer. They use their empathy for the greater good, often focusing on projects that promote harmony and compassion.",
        "crystals": ["Clear Quartz", "Rose Quartz"]
    },
    "6,11": {
        "personality": "A visionary nurturer. They possess strong intuition and empathy, often inspiring others with their compassionate ideas and spiritual insights.",
        "crystals": ["Selenite", "Rose Quartz"]
    },
    "7,1": {
        "personality": "A spiritual leader. These individuals combine introspection with leadership skills, often excelling in roles that require deep understanding and innovation.",
        "crystals": ["Amethyst", "Garnet"]
    },
    "7,2": {
        "personality": "A diplomatic spiritualist. They balance introspection with harmony, excelling in roles that require both deep understanding and collaboration.",
        "crystals": ["Moonstone", "Amethyst"]
    },
    "7,3": {
        "personality": "A creative spiritualist. They combine introspection with creativity, often excelling in fields that require both deep understanding and artistic expression.",
        "crystals": ["Citrine", "Amethyst"]
    },
    "7,4": {
        "personality": "A structured spiritualist. They combine introspection with discipline, often excelling in roles that require both deep understanding and organization.",
        "crystals": ["Smoky Quartz", "Amethyst"]
    },
    "7,5": {
        "personality": "An adventurous spiritualist. They combine introspection with adaptability, often excelling in roles that require both deep understanding and change.",
        "crystals": ["Turquoise", "Amethyst"]
    },
    "7,6": {
        "personality": "A nurturing spiritualist. They combine introspection with empathy, often excelling in roles that require both deep understanding and compassion.",
        "crystals": ["Rose Quartz", "Amethyst"]
    },
    "7,7": {
        "personality": "A double dose of spirituality! These individuals are highly introspective, insightful, and excel in roles that require deep understanding and wisdom.",
        "crystals": ["Amethyst", "Labradorite"]
    },
    "7,8": {
        "personality": "A powerful spiritualist. They combine introspection with ambition, often excelling in fields that require both deep understanding and leadership.",
        "crystals": ["Pyrite", "Amethyst"]
    },
    "7,9": {
        "personality": "A humanitarian spiritualist. They use their introspection for the greater good, often focusing on projects that promote harmony and compassion.",
        "crystals": ["Clear Quartz", "Amethyst"]
    },
    "7,11": {
        "personality": "A visionary spiritualist. They possess strong intuition and introspection, often inspiring others with their deep insights and spiritual wisdom.",
        "crystals": ["Selenite", "Amethyst"]
    },
    "8,1": {
        "personality": "A powerful leader. These individuals combine ambition with leadership skills, often excelling in roles that require innovation and authority.",
        "crystals": ["Pyrite", "Garnet"]
    },
    "8,2": {
        "personality": "A diplomatic powerhouse. They balance ambition with harmony, excelling in roles that require both authority and collaboration.",
        "crystals": ["Moonstone", "Pyrite"]
    },
    "8,3": {
        "personality": "A creative powerhouse. They combine ambition with creativity, often excelling in fields that require both authority and artistic expression.",
        "crystals": ["Citrine", "Pyrite"]
    },
    "8,4": {
        "personality": "A structured powerhouse. They combine ambition with discipline, often excelling in roles that require both authority and organization.",
        "crystals": ["Smoky Quartz", "Pyrite"]
    },
    "8,5": {
        "personality": "An adventurous powerhouse. They combine ambition with adaptability, often excelling in roles that require both authority and change.",
        "crystals": ["Turquoise", "Pyrite"]
    },
    "8,6": {
        "personality": "A nurturing powerhouse. They combine ambition with empathy, often excelling in roles that require both authority and compassion.",
        "crystals": ["Rose Quartz", "Pyrite"]
    },
    "8,7": {
        "personality": "A spiritual powerhouse. They blend ambition with introspection, often seeking deeper meaning in their authoritative pursuits.",
        "crystals": ["Amethyst", "Pyrite"]
    },
    "8,8": {
        "personality": "A double dose of power! These individuals are highly ambitious, authoritative, and excel in roles that require leadership and innovation.",
        "crystals": ["Pyrite", "Garnet"]
    },
    "8,9": {
        "personality": "A humanitarian powerhouse. They use their ambition for the greater good, often focusing on projects that promote harmony and compassion.",
        "crystals": ["Clear Quartz", "Pyrite"]
    },
    "8,11": {
        "personality": "A visionary powerhouse. They possess strong intuition and ambition, often inspiring others with their authoritative ideas and spiritual insights.",
        "crystals": ["Selenite", "Pyrite"]
    },
    "9,1": {
        "personality": "A humanitarian leader. These individuals combine altruism with leadership skills, often excelling in roles that require compassion and innovation.",
        "crystals": ["Clear Quartz", "Garnet"]
    },
    "9,2": {
        "personality": "A diplomatic humanitarian. They balance altruism with harmony, excelling in roles that require both compassion and collaboration.",
        "crystals": ["Moonstone", "Clear Quartz"]
    },
    "9,3": {
        "personality": "A creative humanitarian. They combine altruism with creativity, often excelling in fields that require both compassion and artistic expression.",
        "crystals": ["Citrine", "Clear Quartz"]
    },
    "9,4": {
        "personality": "A structured humanitarian. They combine altruism with discipline, often excelling in roles that require both compassion and organization.",
        "crystals": ["Smoky Quartz", "Clear Quartz"]
    },
    "9,5": {
        "personality": "An adventurous humanitarian. They combine altruism with adaptability, often excelling in roles that require both compassion and change.",
        "crystals": ["Turquoise", "Clear Quartz"]
    },
    "9,6": {
        "personality": "A nurturing humanitarian. They combine altruism with empathy, often excelling in roles that require both compassion and support.",
        "crystals": ["Rose Quartz", "Clear Quartz"]
    },
    "9,7": {
        "personality": "A spiritual humanitarian. They blend altruism with introspection, often seeking deeper meaning in their compassionate pursuits.",
        "crystals": ["Amethyst", "Clear Quartz"]
    },
    "9,8": {
        "personality": "A powerful humanitarian. They combine altruism with ambition, often excelling in fields that require both compassion and leadership.",
        "crystals": ["Pyrite", "Clear Quartz"]
    },
    "9,9": {
        "personality": "A double dose of humanitarianism! These individuals are highly altruistic, compassionate, and excel in roles that require empathy and support.",
        "crystals": ["Clear Quartz", "Rhodonite"]
    },
    "9,11": {
        "personality": "A visionary humanitarian. They possess strong intuition and altruism, often inspiring others with their compassionate ideas and spiritual insights.",
        "crystals": ["Selenite", "Clear Quartz"]
    },
    "11,1": {
        "personality": "A visionary leader. These individuals combine intuition with leadership skills, often excelling in roles that require innovation and spiritual insight.",
        "crystals": ["Selenite", "Garnet"]
    },
    "11,2": {
        "personality": "A diplomatic visionary. They balance intuition with harmony, excelling in roles that require both spiritual insight and collaboration.",
        "crystals": ["Moonstone", "Selenite"]
    },
    "11,3": {
        "personality": "A creative visionary. They combine intuition with creativity, often excelling in fields that require both spiritual insight and artistic expression.",
        "crystals": ["Citrine", "Selenite"]
    },
    "11,4": {
        "personality": "A structured visionary. They combine intuition with discipline, often excelling in roles that require both spiritual insight and organization.",
        "crystals": ["Smoky Quartz", "Selenite"]
    },
    "11,5": {
        "personality": "An adventurous visionary. They combine intuition with adaptability, often excelling in roles that require both spiritual insight and change.",
        "crystals": ["Turquoise", "Selenite"]
    },
    "11,6": {
        "personality": "A nurturing visionary. They combine intuition with empathy, often excelling in roles that require both spiritual insight and compassion.",
        "crystals": ["Rose Quartz", "Selenite"]
    },
    "11,7": {
        "personality": "A spiritual visionary. They blend intuition with introspection, often seeking deeper meaning in their spiritual pursuits.",
        "crystals": ["Amethyst", "Selenite"]
    },
    "11,8": {
        "personality": "A powerful visionary. They combine intuition with ambition, often excelling in fields that require both spiritual insight and leadership.",
        "crystals": ["Pyrite", "Selenite"]
    },
    "11,9": {
        "personality": "A humanitarian visionary. They use their intuition for the greater good, often focusing on projects that promote harmony and compassion.",
        "crystals": ["Clear Quartz", "Selenite"]
    },
    "11,11": {
        "personality": "A double dose of vision! These individuals are highly intuitive, insightful, and excel in roles that require spiritual wisdom and innovation.",
        "crystals": ["Selenite", "Amethyst"]
    },
    "22,1": {
        "personality": "A master builder leader. These individuals combine vision with leadership skills, often excelling in roles that require innovation and strategic planning.",
        "crystals": ["Selenite", "Garnet"]
    },
    "22,2": {
        "personality": "A diplomatic master builder. They balance vision with harmony, excelling in roles that require both strategic planning and collaboration.",
        "crystals": ["Moonstone", "Selenite"]
    },
    "22,3": {
        "personality": "A creative master builder. They combine vision with creativity, often excelling in fields that require both strategic planning and artistic expression.",
        "crystals": ["Citrine", "Selenite"]
    },
    "22,4": {
        "personality": "A structured master builder. They combine vision with discipline, often excelling in roles that require both strategic planning and organization.",
        "crystals": ["Smoky Quartz", "Selenite"]
    },
    "22,5": {
        "personality": "An adventurous master builder. They combine vision with adaptability, often excelling in roles that require both strategic planning and change.",
        "crystals": ["Turquoise", "Selenite"]
    },
    "22,6": {
        "personality": "A nurturing master builder. They combine vision with empathy, often excelling in roles that require both strategic planning and compassion.",
        "crystals": ["Rose Quartz", "Selenite"]
    },
    "22,7": {
        "personality": "A spiritual master builder. They blend vision with introspection, often seeking deeper meaning in their strategic pursuits.",
        "crystals": ["Amethyst", "Selenite"]
    },
    "22,8": {
        "personality": "A powerful master builder. They combine vision with ambition, often excelling in fields that require both strategic planning and leadership.",
        "crystals": ["Pyrite", "Selenite"]
    },
    "22,9": {
        "personality": "A humanitarian master builder. They use their vision for the greater good, often focusing on projects that promote harmony and compassion.",
        "crystals": ["Clear Quartz", "Selenite"]
    },
    "22,11": {
        "personality": "A visionary master builder. They possess strong intuition and vision, often inspiring others with their strategic ideas and spiritual insights.",
        "crystals": ["Selenite", "Amethyst"]
    },
    "33,1": {
        "personality": "A master teacher leader. These individuals combine wisdom with leadership skills, often excelling in roles that require innovation and spiritual guidance.",
        "crystals": ["Selenite", "Garnet"]
    },
    "33,2": {
        "personality": "A diplomatic master teacher. They balance wisdom with harmony, excelling in roles that require both spiritual guidance and collaboration.",
        "crystals": ["Moonstone", "Selenite"]
    },
    "33,3": {
        "personality": "A creative master teacher. They combine wisdom with creativity, often excelling in fields that require both spiritual guidance and artistic expression.",
        "crystals": ["Citrine", "Selenite"]
    },
    "33,4": {
        "personality": "A structured master teacher. They combine wisdom with discipline, often excelling in roles that require both spiritual guidance and organization.",
        "crystals": ["Smoky Quartz", "Selenite"]
    },
    "33,5": {
        "personality": "An adventurous master teacher. They combine wisdom with adaptability, often excelling in roles that require both spiritual guidance and change.",
        "crystals": ["Turquoise", "Selenite"]
    },
    "33,6": {
        "personality": "A nurturing master teacher. They combine wisdom with empathy, often excelling in roles that require both spiritual guidance and compassion.",
        "crystals": ["Rose Quartz", "Selenite"]
    },
    "33,7": {
        "personality": "A spiritual master teacher. They blend wisdom with introspection, often seeking deeper meaning in their spiritual pursuits.",
        "crystals": ["Amethyst", "Selenite"]
    },
    "33,8": {
        "personality": "A powerful master teacher. They combine wisdom with ambition, often excelling in fields that require both spiritual guidance and leadership.",
        "crystals": ["Pyrite", "Selenite"]
    },
    "33,9": {
        "personality": "A humanitarian master teacher. They use their wisdom for the greater good, often focusing on projects that promote harmony and compassion.",
        "crystals": ["Clear Quartz", "Selenite"]
    },
    "33,11": {
        "personality": "A visionary master teacher. They possess strong intuition and wisdom, often inspiring others with their spiritual ideas and insights.",
        "crystals": ["Selenite", "Amethyst"]
    }
} 